Community-PIO-CH32V/platform-ch32v/misc/svd/CH32V208xx.svd
	<register>
          <name>CFGR2</name>
          <displayName>CFGR2</displayName>
          <description>Clock configuration register2
          (RCC_CFGR2)</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PREDIV1</name>
              <description>PREDIV1 division factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PREDIV2</name>
              <description>PREDIV2 division factor</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PLL2MUL</name>
              <description>PLL2 Multiplication Factor</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PLL3MUL</name>
              <description>PLL3 Multiplication Factor</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PREDIV1SRC</name>
              <description>PREDIV1 entry clock source</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2S2SRC</name>
              <description>I2S2 clock source</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2S3SRC</name>
              <description>I2S3 clock source</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
		      	<field>
              <name>TRNGSRC</name>
              <description>TRNG clock source</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
		      	<field>
              <name>ETH1GSRC</name>
              <description>ETH1G clock source</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
		      	<field>
              <name>ETH1GEN</name>
              <description>ETH1G _125M clock enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
		      	<field>
              <name>USBHSDIV</name>
              <description>USB HS PREDIV division factor</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
			<field>
              <name>USBHSPLLSRC</name>
              <description>USB HS Multiplication Factor clock source</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>USBHSCLK</name>
              <description>USB HS Peference Clock source </description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
			<field>
              <name>USBHSPLL</name>
              <description>USB HS Multiplication control </description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>USBFSSRC</name>
              <description>USB FS clock source </description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EXTEND</name>
      <description> Extend configuration</description>
      <groupName>EXTEND</groupName>
      <baseAddress>0x40023800</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EXTEND_CTR</name>
          <displayName>EXTEND</displayName>
          <description>EXTEND register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000A40</resetValue>
          <fields>
            <field>
              <name>USBDLS</name>
              <description>USBD Lowspeed Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>  
            <field>
              <name>USBDPU</name>
              <description>USBD pullup Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
            <field>
              <name>ETH10M</name>
              <description>ETH 10M Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETHRGMII</name>
              <description>ETH RGMII Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>  
            <field>
              <name>HSIPRE</name>
              <description>Whether HSI is divided </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LKUPEN</name>
              <description>LOCKUP_Eable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
            <field>
              <name>LOCKUP_RSTF</name>
              <description>LOCKUP RESET</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>    
            <field>
              <name>ULLDOTRIM</name>
              <description>ULLDO_TRIM</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>  
            <field>
              <name>LDOTRIM</name>
              <description>LDO_TRIM</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSEKPLP</name>
              <description>HSE_KEEP_LP</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>    
          </fields>
        </register>
        <register>
          <name>CR</name>
          <displayName>OPA_CR</displayName>
          <description>OPA Control register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN1</name>
              <description>OPA Enable1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>  
               <field>
              <name>MODE1</name>
              <description>OPA MODE1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
               <field>
              <name>NSEL1</name>
              <description>OPA NSEL1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
               <field>
              <name>PSEL1</name>
              <description>OPA PSEL1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>  
               <field>
              <name>EN2</name>
              <description>OPA Enable2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
			<field>
              <name>MODE2</name>
              <description>OPA MODE2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
               <field>
              <name>NSEL2</name>
              <description>OPA NSEL2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
               <field>
              <name>PSEL2</name>
              <description>OPA PSEL2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>    
                  <field>
              <name>EN3</name>
              <description>OPA Eable3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>  
                 <field>
              <name>MODE3</name>
              <description>OPA MODE3</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
                 <field>
              <name>NSEL3</name>
              <description>OPA NSEL3</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
                 <field>
              <name>PSEL3</name>
              <description>OPA PSEL3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
                 <field>
              <name>EN4</name>
              <description>OPA Enable4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
                 <field>
              <name>MODE4</name>
              <description>OPA MODE4</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 	
                 <field>
              <name>NSEL4</name>
              <description>OPA NSEL4 </description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 	
                 <field>
              <name>PSEL4</name>
              <description>OPA PSEL4</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 				
          </fields>
        </register>
