Community-PIO-CH32V/platform-ch32v/misc/svd/CH32V208xx.svd
						<register>
			<name>UEP10_T_LEN</name>
			<description>endpoint 10 send the length</description>
			<addressOffset>0x100</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP10_T_LEN</name>
					<description> endpoint 10 send the length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			<register>
			<name>UEP10_TX_CTRL</name>
			<description>endpoint 10  send control</description>
			<addressOffset>0x102</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_T_RES</name>
					<description> endpoint 10 control of the send response to IN transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_T_TOG</name>
					<description> endpoint 10 synchronous trigger bit for the sender to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>RB_UEP_T_TOG_AUTO</name>
					<description> endpoint 10 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			<register>
			<name>UEP10_RX_CTRL</name>
			<description>endpoint 10  send control</description>
			<addressOffset>0x103</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_R_RES</name>
					<description> endpoint 10 control of the accept response to OUT transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_R_TOG</name>
					<description> endpoint 10 synchronous trigger bit for the accept to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>RB_UEP_R_TOG_AUTO</name>
					<description> endpoint 10 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-only</access>
			</field>
			</fields>
			</register>	
			
						<register>
			<name>UEP11_T_LEN</name>
			<description>endpoint 11 send the length</description>
			<addressOffset>0x104</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP0_T_LEN</name>
					<description> endpoint 11 send the length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			<register>
			<name>UEP11_TX_CTRL</name>
			<description>endpoint 11  send control</description>
			<addressOffset>0x106</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_T_RES</name>
					<description> endpoint 11 control of the send response to IN transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_T_TOG</name>
					<description> endpoint 11 synchronous trigger bit for the sender to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>RB_UEP_T_TOG_AUTO</name>
					<description> endpoint 11 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			<register>
			<name>UEP11_RX_CTRL</name>
			<description>endpoint 11 send control</description>
			<addressOffset>0x107</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_R_RES</name>
					<description> endpoint 11 control of the accept response to OUT transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_R_TOG</name>
					<description> endpoint 11 synchronous trigger bit for the accept to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>RB_UEP_R_TOG_AUTO</name>
					<description> endpoint 11 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-only</access>
			</field>
			</fields>
			</register>	
			
						<register>
			<name>UEP12_T_LEN</name>
			<description>endpoint 12 send the length</description>
			<addressOffset>0x108</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP0_T_LEN</name>
					<description> endpoint 12 send the length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			<register>
			<name>UEP12_TX_CTRL</name>
			<description>endpoint 12  send control</description>
			<addressOffset>0x10A</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_T_RES</name>
					<description> endpoint 12 control of the send response to IN transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_T_TOG</name>
					<description> endpoint 12 synchronous trigger bit for the sender to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>RB_UEP_T_TOG_AUTO</name>
					<description> endpoint 12 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			<register>
			<name>UEP12_RX_CTRL</name>
			<description>endpoint 12 send control</description>
			<addressOffset>0x10B</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_R_RES</name>
					<description> endpoint 12 control of the accept response to OUT transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_R_TOG</name>
					<description> endpoint 12 synchronous trigger bit for the accept to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>RB_UEP_R_TOG_AUTO</name>
					<description> endpoint 12 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-only</access>
			</field>
			</fields>
			</register>	
			
		<register>
			<name>UEP13_T_LEN</name>
			<description>endpoint 13 send the length</description>
			<addressOffset>0x10C</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP13_T_LEN</name>
					<description> endpoint 13 send the length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			<register>
			<name>UEP13_TX_CTRL</name>
			<description>endpoint 13  send control</description>
			<addressOffset>0x10E</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_T_RES</name>
					<description> endpoint 13 control of the send response to IN transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_T_TOG</name>
					<description> endpoint 13 synchronous trigger bit for the sender to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>RB_UEP_T_TOG_AUTO</name>
					<description> endpoint 13 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			<register>
			<name>UEP13_RX_CTRL</name>
			<description>endpoint 13  send control</description>
			<addressOffset>0x10F</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_R_RES</name>
					<description> endpoint 13 control of the accept response to OUT transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_R_TOG</name>
					<description> endpoint 13 synchronous trigger bit for the accept to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>RB_UEP_R_TOG_AUTO</name>
					<description> endpoint 13 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-only</access>
			</field>
			</fields>
			</register>	
			
		<register>
			<name>UEP14_T_LEN</name>
			<description>endpoint 14 send the length</description>
			<addressOffset>0x110</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP14_T_LEN</name>
					<description> endpoint 14 send the length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
		<register>
			<name>UEP14_TX_CTRL</name>
			<description>endpoint 14  send control</description>
			<addressOffset>0x112</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_T_RES</name>
					<description> endpoint 14 control of the send response to IN transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_T_TOG</name>
					<description> endpoint 14 synchronous trigger bit for the sender to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>RB_UEP_T_TOG_AUTO</name>
					<description> endpoint 14 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
		<register>
			<name>UEP14_RX_CTRL</name>
			<description>endpoint 14 send control</description>
			<addressOffset>0x113</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_R_RES</name>
					<description> endpoint 14 control of the accept response to OUT transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_R_TOG</name>
					<description> endpoint 14 synchronous trigger bit for the accept to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>RB_UEP_R_TOG_AUTO</name>
					<description> endpoint 14 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-only</access>
			</field>
			</fields>
			</register>	
			
		<register>
			<name>UEP15_T_LEN</name>
			<description>endpoint 15 send the length</description>
			<addressOffset>0x114</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP0_T_LEN</name>
					<description> endpoint 15 send the length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			<register>
			<name>UEP15_TX_CTRL</name>
			<description>endpoint 15  send control</description>
			<addressOffset>0x116</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_T_RES</name>
					<description> endpoint 15 control of the send response to IN transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_T_TOG</name>
					<description> endpoint 15 synchronous trigger bit for the sender to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>RB_UEP_T_TOG_AUTO</name>
					<description> endpoint 15 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			<register>
			<name>UEP15_RX_CTRL</name>
			<description>endpoint 15  send control</description>
			<addressOffset>0x117</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_R_RES</name>
					<description> endpoint 15 control of the accept response to OUT transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_R_TOG</name>
					<description> endpoint 15 synchronous trigger bit for the accept to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>RB_UEP_R_TOG_AUTO</name>
					<description> endpoint 15 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-only</access>
			</field>
			</fields>
			</register>	
