Community-PIO-CH32V/platform-ch32v/misc/svd/CH32V208xx.svd
		</registers>
	</peripheral>
	<peripheral>
      <name>CRC</name>
      <description>CRC calculation unit</description>
      <groupName>CRC</groupName>
      <baseAddress>0x40023000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DATAR</name>
          <displayName>DATAR</displayName>
          <description>Data register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DR</name>
              <description>Data Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDATAR</name>
          <displayName>IDATAR</displayName>
          <description>Independent Data register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDR</name>
              <description>Independent Data register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTLR</name>
          <displayName>CTLR</displayName>
          <description>Control register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RST</name>
              <description>Reset bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>FLASH</name>
      <description>FLASH</description>
      <groupName>FLASH</groupName>
      <baseAddress>0x40022000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLASH</name>
        <description>Flash global interrupt</description>
        <value>20</value>
      </interrupt>
      <registers>
        <register>
          <name>KEYR</name>
          <displayName>KEYR</displayName>
          <description>Flash key register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEYR</name>
              <description>FPEC key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OBKEYR</name>
          <displayName>OBKEYR</displayName>
          <description>Flash option key register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OPTKEY</name>
              <description>Option byte key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATR</name>
          <displayName>STATR</displayName>
          <description>Status register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
          <field>
              <name>EHMODS</name>
              <description>Enhance mode start</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EOP</name>
              <description>End of operation</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRPRTERR</name>
              <description>Write protection error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRBSY</name>
              <description>Quick page programming</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BSY</name>
              <description>Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTLR</name>
          <displayName>CTLR</displayName>
          <description>Control register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>PG</name>
              <description>Programming</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER</name>
              <description>Page Erase</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MER</name>
              <description>Mass Erase</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OBPG</name>
              <description>Option byte programming</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OBER</name>
              <description>Option byte erase</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STRT</name>
              <description>Start</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OBWRE</name>
              <description>Option bytes write enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIE</name>
              <description>Error interrupt enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOPIE</name>
              <description>End of operation interrupt
              enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLOCK</name>
              <description>Fast programmable lock</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTPG</name>
              <description>Fast programming</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTER</name>
              <description>Fast erase</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BER32</name>
              <description>Block Erase 32K</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>PGSTRT</name>
              <description>Page Programming Start</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>RSENACT</name>
              <description>Reset Flash Enhance read mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>EHMOD</name>
              <description>Flash Enhance read mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>SCKMODE</name>
              <description>Flash SCK mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR</name>
          <displayName>ADDR</displayName>
          <description>Flash address register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FAR</name>
              <description>Flash Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OBR</name>
          <displayName>OBR</displayName>
          <description>Option byte register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x03FFFFFC</resetValue>
          <fields>
            <field>
              <name>OBERR</name>
              <description>Option byte error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDPRT</name>
              <description>Read protection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDGSW</name>
              <description>IWDG_SW</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STOPRST</name>
              <description>STOP_RST</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STANDYRST</name>
              <description>STANDY_RST</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			      <field>
              <name>SRAM_CODE_MODE</name>
              <description>SRAM_CODE_MODE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WPR</name>
          <displayName>WPR</displayName>
          <description>Write protection register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>WRP</name>
              <description>Write protect</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MODEKEYR</name>
          <displayName>MODEKEYR</displayName>
          <description>Mode select register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MODEKEYR</name>
              <description>Mode select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
		
        <register>
          <name>HSE_CAL_CTRL</name>
          <displayName>HSE_CAL_CTRL</displayName>
          <description>External crystal oscillator calibration control register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x09000000</resetValue>
          <fields>
            <field>
              <name>HSEITRIM</name>
              <description>HSE initiation current adjustment bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>HSEFAULT</name>
              <description>HSE Failure Detection Disable Control Bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>			
            <field>
              <name>HSEC</name>
              <description>HSE Built-in Matching Capacitor Adjustment Bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
			  <access>read-write</access>
            </field>			
          </fields>
        </register>		
        <register>
          <name>LSI32K_TUNE</name>
          <displayName>LSI32K_TUNE</displayName>
          <description>Internal Low Speed Crystal Calibration Adjustment Register</description>
          <addressOffset>0x36</addressOffset>
          <size>0x10</size>
          <resetValue>0x1011</resetValue>
          <fields>
            <field>
              <name>LTUNE</name>
              <description>LSI32K coarse configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>HTUNE</name>
              <description>LSI32K fine-tunes the configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>8</bitWidth>
			  <access>read-write</access>
            </field>			
          </fields>
        </register>			
        <register>
          <name>LSI32K_CAL_CFG</name>
          <displayName>LSI32K_CAL_CFG</displayName>
          <description>Internal low-speed crystal calibration configuration register</description>
          <addressOffset>0x49</addressOffset>
          <size>0x8</size>
          <resetValue>0x01</resetValue>
          <fields>
            <field>
              <name>CNTVLU</name>
              <description>LSI32K calibrated sampling duration configuration bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>HALTMD</name>
              <description>LSI32K Calibration Count Pause Duration Configuration Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>WKUPEN</name>
              <description>LSI32K Wake-Up Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>LPEN</name>
              <description>Calibrate enable bit in low-power mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>		
          </fields>
        </register>		
        <register>
          <name>LSI32K_CAL_STATR</name>
          <displayName>LSI32K_CAL_STATR</displayName>
          <description>Internal low-speed crystal calibration status register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x10</size>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>For several CK32K cycles, the count value is based on the system frequency</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
			  <access>read-only</access>
            </field>
            <field>
              <name>CNTOV</name>
              <description>LSI32K Sample Counter Overflow Flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>IFEND</name>
              <description>LSI32K Calibration Count End Interrupt Flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>			
          </fields>
        </register>		
        <register>
          <name>LSI32K_CAL_OV_CNT</name>
          <displayName>LSI32K_CAL_OV_CNT</displayName>
          <description>Internal low-speed crystal calibration times counter</description>
          <addressOffset>0x4E</addressOffset>
          <size>0x10</size>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>OVCNT</name>
              <description>The number of LSI32K sample counter overflows</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
			  <access>read-only</access>
            </field>			
          </fields>
        </register>		
        <register>
          <name>LSI32K_CAL_CTRL</name>
          <displayName>LSI32K_CAL_CTRL</displayName>
          <description>Internal low-speed crystal calibration control register</description>
          <addressOffset>0x4F</addressOffset>
          <size>0x10</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>CALINTEN</name>
              <description>LSI32K Calibration Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CALEN</name>
              <description>LSI32K Calibration Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>HALT</name>
              <description>LSI32K Calibrated Count Status Bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>			
          </fields>
        </register>		
		
